[
    {
        "id": 1,
        "title": "Adobe представляет ИИ-инструмент «Generative Fill» для Photoshop",
        "slug": "adobe-predstavliaet-ii-instrument-generative-fill-dlia-photoshop",
        "excerpt": "Революционная функция, которая позволяет за считанные секунды дополнять изображения, удалять объекты и изменять композицию с помощью текстовых запросов.",
        "content": "Компания Adobe официально анонсировала выход мощного инструмента «Generative Fill», встроенного в Photoshop. Теперь дизайнеры могут просто выделить область на изображении, ввести текстовый запрос (например, «добавь горы на задний план» или «убери человека в черной куртке»), и нейросеть мгновенно создаст фотореалистичное изменение. Это обещает кардинально ускорить процесс ретуши и создания сложных композиций, открывая новые горизонты для цифрового искусства.",
        "image_path": "news\/9Hk3n9Muz9d5EsEYbX3z1Dp3eTy993L1PslCJD8I.jpg",
        "category": "Разработка",
        "is_featured": 1,
        "is_published": 1,
        "author_id": 1,
        "views_count": 28,
        "created_at": "2025-11-27 06:37:22",
        "updated_at": "2026-02-26 09:10:56",
        "published_at": "2025-11-27 06:37:22"
    },
    {
        "id": 2,
        "title": "Figma запускает режим «Dev Mode» для улучшения взаимодействия дизайнеров и разработчиков",
        "slug": "figma-zapuskaet-rezim-dev-mode-dlia-ulucseniia-vzaimodeistviia-dizainerov-i-razrabotcikov",
        "excerpt": "Новый рабочий режим в Figma, созданный специально для разработчиков, который упрощает перенос дизайна в код.",
        "content": "Figma продолжает устранять разрыв между дизайном и разработкой. Новый «Dev Mode» — это выделенное рабочее пространство, где разработчики могут быстро получать информацию о стилях (CSS, SwiftUI и т.д.), измерять расстояния, экспортировать ресурсы и видеть все компоненты и их варианты. Это значительно ускоряет процесс верстки и делает collaboration между командами еще более эффективным.",
        "image_path": "news\/INkz4OIVUYExx1xf1BG6WLgaBiHkraYp8YoYqDnt.jpg",
        "category": "Разработка",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 27,
        "created_at": "2025-11-27 06:38:48",
        "updated_at": "2026-02-23 03:52:55",
        "published_at": "2025-11-27 06:38:48"
    },
    {
        "id": 3,
        "title": "Тренд 2025: Неоморфизм возвращается в дизайн интерфейсов",
        "slug": "trend-2025-neomorfizm-vozvrashhaetsia-v-dizain-interfeisov",
        "excerpt": "После долгого доминирования скевоморфизма и flat-дизайна, мягкие и объемные формы неоморфизма снова завоевывают популярность в UI.",
        "content": "Дизайн-сообщество наблюдает возрождение неоморфизма. Этот стиль, характеризующийся мягкими тенями, подсветкой и минималистичным подходом, добавляет интерфейсам тактильности и глубины. Мы подготовили гайд о том, как создавать неоморфные кнопки, карточки и элементы управления в Figma и Photoshop, чтобы ваши проекты выглядели современно и свежо.",
        "image_path": "news\/AjHE7du4W7h3l4X74d14VdCBywzbXyteuIADMznM.jpg",
        "category": "Дизайн",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 1,
        "created_at": "2025-11-27 06:40:55",
        "updated_at": "2026-02-26 07:05:25",
        "published_at": "2025-11-27 06:40:00"
    },
    {
        "id": 4,
        "title": "Бесплатные плагины для Figma, которые сэкономят вам часы работы",
        "slug": "besplatnye-plaginy-dlia-figma-kotorye-sekonomiat-vam-casy-raboty",
        "excerpt": "Подборка из 5 must-have плагинов, которые автоматизируют рутину и расширяют возможности дизайнера.",
        "content": "Работа в Figma может быть еще продуктивнее! Мы протестировали десятки расширений и выбрали лучшие: «Auto Layout» для автоматического выравнивания, «Content Reel» для быстрой подстановки контента, «Unsplash» для интеграции фотографий, «Iconify» для доступа к тысячам иконок и «Similayer» для быстрого выбора похожих слоев. Установите их и сосредоточьтесь на творчестве, а не на рутине.",
        "image_path": "news\/6qLlg0MzT14EbptjQhiwinV6MCOlkckUmwIgcTb5.jpg",
        "category": "События",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 0,
        "created_at": "2025-11-27 06:43:35",
        "updated_at": "2025-11-27 06:43:35",
        "published_at": "2025-11-27 06:43:35"
    },
    {
        "id": 5,
        "title": "Как создать стильную аватарку для социальных сетей в Photoshop: Пошаговый гайд",
        "slug": "kak-sozdat-stilnuiu-avatarku-dlia-socialnyx-setei-v-photoshop-posagovyi-gaid",
        "excerpt": "Подробный урок по созданию запоминающегося профильного изображения с использованием слоев, масок и режимов наложения.",
        "content": "Ваша аватарка — это ваше цифровое лицо. В этом руководстве мы покажем, как превратить обычную фотографию в яркий и профессиональный портрет. Вы узнаете, как выполнить цветокоррекцию, добавить деликатные текстуры, создать градиентную подложку и эффект двойной экспозиции. Все это с использованием неразрушающих техник в Photoshop, чтобы вы могли легко экспериментировать.",
        "image_path": "news\/sfLzDtdIA5cWI0powB9faHec3VEMxLNMxorIhdPu.png",
        "category": "Дизайн",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 3,
        "created_at": "2025-11-27 06:45:16",
        "updated_at": "2025-11-30 12:17:55",
        "published_at": "2025-11-27 06:45:16"
    },
    {
        "id": 6,
        "title": "Photoshop для веба: Новые функции экспорта и оптимизации",
        "slug": "photoshop-dlia-veba-novye-funkcii-eksporta-i-optimizacii",
        "excerpt": "Adobe обновила инструменты экспорта, сделав процесс подготовки графики для сайтов более быстрым и удобным.",
        "content": "Подготовка макетов для веба — crucial часть workflow. В последних обновлениях Photoshop появились улучшенные функции экспорта: «Export As» теперь поддерживает больше форматов, включая SVG, а функция «Генератор ресурсов» позволяет быстро экспортировать слои и группы в нужных размерах. Мы разбираем, как настроить этот процесс для максимальной эффективности.",
        "image_path": "news\/4W8gzkIVucLcVXKAgR4PyE5uxswohc0hwvhxib1J.jpg",
        "category": "Общее",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 0,
        "created_at": "2025-11-27 06:46:55",
        "updated_at": "2025-11-27 06:46:55",
        "published_at": "2025-11-27 06:46:55"
    },
    {
        "id": 7,
        "title": "Дизайн превью: Принципы, которые увеличат CTR",
        "slug": "dizain-previu-principy-kotorye-uvelicat-ctr",
        "excerpt": "Аналитика и советы по созданию кликабельных обложек для видео, которые выделяются в общей ленте.",
        "content": "Превью — это первое, что видит потенциальный зритель. На основе анализа успешных каналов мы выделили ключевые принципы: контрастность, читаемость крупного текста, эмоциональность изображения и использование «стресс-тестов» (просмотр миниатюры в маленьком размере). В статье вы найдете примеры и шаблоны для Figma, которые помогут вам создавать compelling-превью.",
        "image_path": "news\/uYe3Mc1SKZdGI1hSCSWm48ypSG9ALSdVZz2s2azG.jpg",
        "category": "Маркетинг",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 0,
        "created_at": "2025-11-27 06:48:14",
        "updated_at": "2025-11-27 06:48:14",
        "published_at": "2025-11-27 06:48:14"
    },
    {
        "id": 8,
        "title": "Figma представила продвинутые возможности для работы с переменными и выражениями",
        "slug": "figma-predstavila-prodvinutye-vozmoznosti-dlia-raboty-s-peremennymi-i-vyrazeniiami",
        "excerpt": "Теперь в Figma можно создавать по-настоящему динамические прототипы, используя формулы и условия.",
        "content": "Это обновление выводит прототипирование в Figma на новый уровень. Переменные (Variables) позволяют привязывать значения (цвет, текст, число) к различным состояниям компонента. Например, можно создать счетчик, который меняет цвет при достижении определенного значения, или интерактивную форму с валидацией. Это открывает путь к созданию прототипов, которые почти не отличимы от реального приложения.",
        "image_path": "news\/PTuxfdTckvGRugy2FL2ySe90904AapNUPv5kW3EM.jpg",
        "category": "Общее",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 0,
        "created_at": "2025-11-27 06:56:17",
        "updated_at": "2025-11-27 06:56:17",
        "published_at": "2025-11-27 06:56:17"
    },
    {
        "id": 9,
        "title": "Figma представила продвинутые возможности для работы с переменными и выражениями",
        "slug": "figma-predstavila-prodvinutye-vozmoznosti-dlia-raboty-s-peremennymi-i-vyrazeniiami-1",
        "excerpt": "Теперь в Figma можно создавать по-настоящему динамические прототипы, используя формулы и условия.",
        "content": "Это обновление выводит прототипирование в Figma на новый уровень. Переменные (Variables) позволяют привязывать значения (цвет, текст, число) к различным состояниям компонента. Например, можно создать счетчик, который меняет цвет при достижении определенного значения, или интерактивную форму с валидацией. Это открывает путь к созданию прототипов, которые почти не отличимы от реального приложения.",
        "image_path": "news\/QTQbdZ6WbZUgcKhQ8dfJaZPWY5kF7e1I5Ph3vtKL.png",
        "category": "Общее",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 3,
        "created_at": "2025-11-27 06:58:12",
        "updated_at": "2026-02-26 10:14:32",
        "published_at": "2025-11-27 06:58:12"
    },
    {
        "id": 10,
        "title": "От Photoshop к Figma: Гайд по миграции для опытных пользователей",
        "slug": "ot-photoshop-k-figma-gaid-po-migracii-dlia-opytnyx-polzovatelei",
        "excerpt": "Если вы давно работаете в Photoshop, но хотите перейти на Figma, этот гид поможет вам адаптироваться без потери productivity.",
        "content": "Переход с растрового редактора на векторно-ориентированную платформу может быть непростым. Мы сравнили ключевые понятия: слои и фреймы, маски и Auto Layout, корректирующие слои и стили. В статье вы найдете таблицу «аналогов» инструментов и горячих клавиш, а также советы по перестройке мышления для эффективной работы в Figma.",
        "image_path": "news\/0OYlZteWHSfd35WMtvqyqRwGIZwfELIPNOAgudcW.png",
        "category": "Разработка",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 0,
        "created_at": "2025-11-27 06:59:29",
        "updated_at": "2025-11-27 06:59:29",
        "published_at": "2025-11-27 06:59:29"
    },
    {
        "id": 11,
        "title": "ИИ в дизайне: 5 сервисов для генерации контента и изображений прямо в вашем workflow",
        "slug": "ii-v-dizaine-5-servisov-dlia-generacii-kontenta-i-izobrazenii-priamo-v-vasem-workflow",
        "excerpt": "Обзор мощных AI-инструментов, которые интегрируются с Figma и Photoshop, помогая генерировать текст, картинки и иконки.",
        "content": "Искусственный интеллект становится неотъемлемым помощником дизайнера. Мы рассмотрим такие сервисы, как Galileo AI (генерация UI из текстового описания), Uizard (превращение скетча в макет), Khroma (генерация цветовых палитр) и плагины для Figma, которые генерируют реалистичный контент-плейсхолдер. Эти инструменты не заменят дизайнера, но станут мощным источником вдохновения и экономии времени.",
        "image_path": "news\/EagfjqFvcdgUctWtqm6fyRN0tho5eex9s6mJ3dVh.png",
        "category": "Маркетинг",
        "is_featured": 0,
        "is_published": 1,
        "author_id": 1,
        "views_count": 1,
        "created_at": "2025-11-27 07:00:27",
        "updated_at": "2026-02-26 09:25:39",
        "published_at": "2025-11-27 07:00:27"
    }
]